tap "homebrew/bundle"
tap "koekeishiya/formulae"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Secrets scanner built for configurability and speed
brew "betterleaks"

# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"

# Modern, maintained replacement for ls
brew "eza"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"

# Command-line fuzzy finder written in Go
brew "fzf"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"

# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"

# Simple terminal UI for git commands
brew "lazygit"

# Sophisticated file transfer program
brew "lftp"

# Mac App Store command-line interface
brew "mas"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Rsync for cloud storage
brew "rclone"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Rust toolchain installer
brew "rustup"

# Simplified and community-driven man pages
brew "tldr"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Extremely fast Python package installer and resolver, written in Rust
brew "uv"

# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"

# Feature-rich command-line audio/video downloader
brew "yt-dlp"

# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"

# Shell extension to navigate your filesystem faster
brew "zoxide"

# Password manager that keeps all passwords secure behind one password
cask "1password"

# Command-line interface for 1Password
cask "1password-cli"

# Memory training application
cask "anki"

# Utility that prevents the system from going to sleep
cask "caffeine"

# E-books management software
cask "calibre"

# Anthropic's official Claude AI desktop app
cask "claude"

# Voice and text chat software
cask "discord"

# App to build and share containerised applications and microservices
cask "docker-desktop"

# Client for the Dropbox cloud storage service
cask "dropbox"

# VPN client for secure and private internet access
cask "expressvpn"

cask "font-meslo-lg-nerd-font"

# Web browser
cask "google-chrome"

# ZSA keyboard firmware flasher
cask "keymapp"

# Manages online multimedia libs of German, Austrian and Swiss public broadcasters
cask "mediathekview"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Audiobook manager for Audible users
cask "openaudible"

# Toolbox companion for QMK Firmware
cask "qmk-toolbox"

# Archive manager for data compression and backups
cask "rar"

# Control your tools with a few keystrokes
cask "raycast"

# Window snapping tool
cask "rectangle-pro"

# Instant messaging application focusing on security
cask "signal"

# Team communication and collaboration software
cask "slack"

# Music streaming service
cask "spotify"

# Video game digital distribution service
cask "steam"

# Application for interacting with Internet Relay Chat (IRC) chatrooms
cask "textual"

# To-do & task list manager
cask "ticktick"

# Web browser focusing on security
cask "tor-browser"

# Configurable document editor that supports Markdown
cask "typora"

# Multimedia player
cask "vlc"

# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"

# Multiplayer code editor
cask "zed"

mas "Audiobook Builder", id: 1437681957

mas "DWDS", id: 6741328425

mas "Goodnotes", id: 1444383602
